In [2]:
from randomuser import RandomUser
import sqlite3
import prettytable

In [3]:
# create a list of X random users
r=RandomUser()
random_users=r.generate_users(100) # set users you want to generate. 5 in this case.
users_data = []
for id, user in enumerate(random_users,start=1):
	user_data=tuple([id,user.get_first_name(), user.get_last_name(), user.get_email(), user.get_city(), user.get_country()])
	users_data.append(user_data)

In [4]:
conn = sqlite3.connect('mydatabase.db')
cursor = conn.cursor()

In [5]:
# Drop the table if already exists.
cursor.execute("DROP TABLE IF EXISTS USERS")

# Creating table
table = " create table IF NOT EXISTS USERS(ID INTEGER PRIMARY KEY NOT NULL, FNAME VARCHAR(20), LNAME VARCHAR(20), EMAIL VARCHAR(30), CITY VARCHAR(20), COUNTRY VARCHAR(20));"
cursor.execute(table)
print("Table is Ready")

Table is Ready

In [6]:
# Inserting all the data at once with executemany()
cursor.executemany("insert into USERS values (?,?,?,?,?,?)", users_data)

In [7]:
# Save (commit) the changes at the database
conn.commit()

In [8]:
select_all = "SELECT * FROM USERS LIMIT 5"
cursor.execute(select_all)
all_data=cursor.fetchall()
#few_data=cursor.fetchmany(2) ##for fetching idicate number of rows
for row in all_data:
	print(row)

(1, 'Harry', 'Walker', 'harry.walker@example.com', 'Nelson', 'New Zealand')
(2, 'Dolores', 'Lewis', 'dolores.lewis@example.com', 'Maitland', 'Australia')
(3, 'Isaac', 'Soto', 'isaac.soto@example.com', 'Torrej√≥n de Ardoz', 'Spain')
(4, 'Sido', 'Ermers', 'sido.ermers@example.com', 'Herten', 'Netherlands')
(5, 'Harrison', 'Kumar', 'harrison.kumar@example.com', 'Rotorua', 'New Zealand')

In [9]:
select_name= "SELECT FNAME FROM USERS"
cursor.execute(select_name)
f_names=cursor.fetchmany(2)
for name in f_names:
	print(name)

('Harry',)
('Dolores',)

In [10]:
#Function to update user name by id
def update_user_name(new_name,id):
	cursor.execute('SELECT FNAME FROM USERS WHERE ID=?',(id,))
	old_name=cursor.fetchone()[0]
	cursor.execute('UPDATE USERS SET FNAME=? WHERE ID=?',(new_name, id))
	cursor.execute('SELECT * FROM USERS WHERE ID=?',(id,))
	row_updated=cursor.fetchone()
	print(f"User name updated from {old_name} to {new_name} successfully")
	print(row_updated)
	return conn.commit()

In [11]:
update_user_name('Selim',2)

User name updated from Dolores to Selim successfully
(2, 'Selim', 'Lewis', 'dolores.lewis@example.com', 'Maitland', 'Australia')

In [12]:
cursor.close()
conn.close()

In [13]:
#connect to the database using sql magic
%load_ext sql
%sql sqlite:///mydatabase.db

In [14]:
prettytable.DEFAULT = 'DEFAULT'

In [15]:
%%sql
DROP TABLE IF EXISTS INTERNATIONAL_STUDENT_TEST_SCORES;

CREATE TABLE INTERNATIONAL_STUDENT_TEST_SCORES (
	country VARCHAR(50),
	first_name VARCHAR(50),
	last_name VARCHAR(50),
	test_score INT
);

INSERT INTO INTERNATIONAL_STUDENT_TEST_SCORES (country, first_name, last_name, test_score)
VALUES
('United States', 'Marshall', 'Bernadot', 54),
('Ghana', 'Celinda', 'Malkin', 51),
('Ukraine', 'Guillermo', 'Furze', 53),
('Greece', 'Aharon', 'Tunnow', 48),
('Russia', 'Bail', 'Goodwin', 46),
('Poland', 'Cole', 'Winteringham', 49),
('Sweden', 'Emlyn', 'Erricker', 55),
('Russia', 'Cathee', 'Sivewright', 49),
('China', 'Barny', 'Ingerson', 57),
('Uganda', 'Sharla', 'Papaccio', 55),
('China', 'Stella', 'Youens', 51),
('Poland', 'Julio', 'Buesden', 48),
('United States', 'Tiffie', 'Cosely', 58),
('Poland', 'Auroora', 'Stiffell', 45),
('China', 'Clarita', 'Huet', 52),
('Poland', 'Shannon', 'Goulden', 45),
('Philippines', 'Emylee', 'Privost', 50),
('France', 'Madelina', 'Burk', 49),
('China', 'Saunderson', 'Root', 58),
('Indonesia', 'Bo', 'Waring', 55),
('China', 'Hollis', 'Domotor', 45),
('Russia', 'Robbie', 'Collip', 46),
('Philippines', 'Davon', 'Donisi', 46),
('China', 'Cristabel', 'Radeliffe', 48),
('China', 'Wallis', 'Bartleet', 58),
('Moldova', 'Arleen', 'Stailey', 38),
('Ireland', 'Mendel', 'Grumble', 58),
('China', 'Sallyann', 'Exley', 51),
('Mexico', 'Kain', 'Swaite', 46),
('Indonesia', 'Alonso', 'Bulteel', 45),
('Armenia', 'Anatol', 'Tankus', 51),
('Indonesia', 'Coralyn', 'Dawkins', 48),
('China', 'Deanne', 'Edwinson', 45),
('China', 'Georgiana', 'Epple', 51),
('Portugal', 'Bartlet', 'Breese', 56),
('Azerbaijan', 'Idalina', 'Lukash', 50),
('France', 'Livvie', 'Flory', 54),
('Malaysia', 'Nonie', 'Borit', 48),
('Indonesia', 'Clio', 'Mugg', 47),
('Brazil', 'Westley', 'Measor', 48),
('Philippines', 'Katrinka', 'Sibbert', 51),
('Poland', 'Valentia', 'Mounch', 50),
('Norway', 'Sheilah', 'Hedditch', 53),
('Papua New Guinea', 'Itch', 'Jubb', 50),
('Latvia', 'Stesha', 'Garnson', 53),
('Canada', 'Cristionna', 'Wadmore', 46),
('China', 'Lianna', 'Gatward', 43),
('Guatemala', 'Tanney', 'Vials', 48),
('France', 'Alma', 'Zavittieri', 44),
('China', 'Alvira', 'Tamas', 50),
('United States', 'Shanon', 'Peres', 45),
('Sweden', 'Maisey', 'Lynas', 53),
('Indonesia', 'Kip', 'Hothersall', 46),
('China', 'Cash', 'Landis', 48),
('Panama', 'Kennith', 'Digance', 45),
('China', 'Ulberto', 'Riggeard', 48),
('Switzerland', 'Judy', 'Gilligan', 49),
('Philippines', 'Tod', 'Trevaskus', 52),
('Brazil', 'Herold', 'Heggs', 44),
('Latvia', 'Verney', 'Note', 50),
('Poland', 'Temp', 'Ribey', 50),
('China', 'Conroy', 'Egdal', 48),
('Japan', 'Gabie', 'Alessandone', 47),
('Ukraine', 'Devlen', 'Chaperlin', 54),
('France', 'Babbette', 'Turner', 51),
('Czech Republic', 'Virgil', 'Scotney', 52),
('Tajikistan', 'Zorina', 'Bedow', 49),
('China', 'Aidan', 'Rudeyeard', 50),
('Ireland', 'Saunder', 'MacLice', 48),
('France', 'Waly', 'Brunstan', 53),
('China', 'Gisele', 'Enns', 52),
('Peru', 'Mina', 'Winchester', 48),
('Japan', 'Torie', 'MacShirrie', 50),
('Russia', 'Benjamen', 'Kenford', 51),
('China', 'Etan', 'Burn', 53),
('Russia', 'Merralee', 'Chaperlin', 38),
('Indonesia', 'Lanny', 'Malam', 49),
('Canada', 'Wilhelm', 'Deeprose', 54),
('Czech Republic', 'Lari', 'Hillhouse', 48),
('China', 'Ossie', 'Woodley', 52),
('Macedonia', 'April', 'Tyer', 50),
('Vietnam', 'Madelon', 'Dansey', 53),
('Ukraine', 'Korella', 'McNamee', 52),
('Jamaica', 'Linnea', 'Cannam', 43),
('China', 'Mart', 'Coling', 52),
('Indonesia', 'Marna', 'Causbey', 47),
('China', 'Berni', 'Daintier', 55),
('Poland', 'Cynthia', 'Hassell', 49),
('Canada', 'Carma', 'Schule', 49),
('Indonesia', 'Malia', 'Blight', 48),
('China', 'Paulo', 'Seivertsen', 47),
('Niger', 'Kaylee', 'Hearley', 54),
('Japan', 'Maure', 'Jandak', 46),
('Argentina', 'Foss', 'Feavers', 45),
('Venezuela', 'Ron', 'Leggitt', 60),
('Russia', 'Flint', 'Gokes', 40),
('China', 'Linet', 'Conelly', 52),
('Philippines', 'Nikolas', 'Birtwell', 57),
('Australia', 'Eduard', 'Leipelt', 53)

 * sqlite:///mydatabase.db
Done.
Done.
99 rows affected.

[]

In [16]:
%%sql
SELECT *FROM INTERNATIONAL_STUDENT_TEST_SCORES LIMIT 5;

 * sqlite:///mydatabase.db
Done.

[('United States', 'Marshall', 'Bernadot', 54),
 ('Ghana', 'Celinda', 'Malkin', 51),
 ('Ukraine', 'Guillermo', 'Furze', 53),
 ('Greece', 'Aharon', 'Tunnow', 48),
 ('Russia', 'Bail', 'Goodwin', 46)]

In [17]:
country='Sweden'
%sql SELECT * FROM INTERNATIONAL_STUDENT_TEST_SCORES WHERE country=:country AND test_score > 50;

 * sqlite:///mydatabase.db
Done.

[('Sweden', 'Emlyn', 'Erricker', 55), ('Sweden', 'Maisey', 'Lynas', 53)]

In [18]:
%sql sqlite:///northwind.db

In [19]:
%%sql
-- 1. how many clients are in France?

SELECT COUNT(*) AS French_Clients FROM Customers WHERE country='France';

   sqlite:///mydatabase.db
 * sqlite:///northwind.db
Done.

[(11,)]

In [20]:
%%sql
-- 2. how many employees are over 60 years old during 2020?
SELECT COUNT(*) AS 'Over_60' FROM Employees WHERE BirthDate < '1960-01-01';

   sqlite:///mydatabase.db
 * sqlite:///northwind.db
Done.

[(5,)]

In [21]:
%%sql
-- 3. the total unit ordered by french clients.
SELECT SUM(Quantity) AS Total_Frech_Units
FROM ((OrderDetails OD INNER JOIN Orders O ON OD.OrderID = O.OrderID) INNER JOIN
Customers C ON O.CustomerID = C.CustomerID)
WHERE C.Country = 'France';

   sqlite:///mydatabase.db
 * sqlite:///northwind.db
Done.

[(889,)]

In [44]:
%%sql
--how many french clients have more than 1 order valued over 1000?

WITH French_Clients AS (SELECT C.CustomerID FROM (CustomerS C INNER JOIN Orders O 
ON C.CustomerID = O.CustomerID) INNER JOIN
(SELECT OD.OrderID, SUM(OD.Quantity*P.Price) AS Total_Price FROM OrderDetails OD INNER JOIN Products P
ON OD.ProductID = P.ProductID GROUP BY OD.OrderID) AS OP 
ON O.OrderID = OP.OrderID
WHERE C.Country = 'France' AND OP.Total_Price > 1000 
GROUP BY C.CustomerID HAVING COUNT(*) > 1)

SELECT COUNT(*) AS FC_with_multiple_orders_over_1000 FROM French_Clients;

   sqlite:///mydatabase.db
 * sqlite:///northwind.db
Done.

[(2,)]

In [36]:
%%sql
-- 5. The city name of some suppliers is incorrect. Update the database so that all instances of 'Londona' are changed to 'London'.

UPDATE Suppliers SET City = 'London' WHERE City = 'Londona';
SELECT SupplierID, City FROM Suppliers WHERE City LIKE 'Lo%';

   sqlite:///mydatabase.db
 * sqlite:///northwind.db
0 rows affected.
Done.

[(1, 'London')]

In [49]:
%%sql
-- 6. how many orders were made in August of 1996? 
SELECT COUNT(*) AS August_Orders FROM Orders WHERE strftime('%m', OrderDate) = '08' AND strftime('%Y', OrderDate) = '1996';

   sqlite:///mydatabase.db
 * sqlite:///northwind.db
Done.

[(25,)]

In [55]:
%%sql
-- 7. From which country were the most units ordered? (Country and Quantity)

WITH Total_Quantity AS (SELECT O.CustomerID,O.OrderID, SUM(OD.Quantity) AS T_Quantity FROM OrderDetails OD INNER JOIN Orders O
ON OD.OrderID = O.OrderID
GROUP BY O.OrderID)
SELECT C.Country,SUM(TQ.T_Quantity) AS Total_Units FROM Customers C INNER JOIN Total_Quantity TQ
ON C.CustomerID = TQ.CustomerID 
GROUP BY C.Country OrDER BY Total_Units DESC LIMIT 1;

   sqlite:///mydatabase.db
 * sqlite:///northwind.db
Done.

[('USA', 2139)]

In [60]:
%%sql
-- 8. Which employee entered the fewest orders?
SELECT E.FirstName,E.LastName, COUNT(O.OrderID) AS Total_Orders FROM Employees E INNER JOIN Orders O 
ON E.EmployeeID = O.EmployeeID
GROUP BY E.EmployeeID ORDER BY Total_Orders ASC LIMIT 1;

   sqlite:///mydatabase.db
 * sqlite:///northwind.db
Done.

[('Anne', 'Dodsworth', 6)]

In [88]:
%%sql
--9. Which shipper tranported the most units of condiments?
WITH Total_Condiments AS (SELECT O.ShipperID, SUM(OD.Quantity) Total_Condiments FROM
Products P INNER JOIN OrderDetails OD ON P.ProductID =OD.ProductID INNER JOIN
Orders O ON OD.OrderID = O.OrderID INNER JOIN Categories C ON P.CategoryID = C.CategoryID
WHERE C.CategoryName ='Condiments'
GROUP BY O.ShipperID)
SELECT S.ShipperName, MAX(TC.Total_Condiments) AS Total_Condiments FROM Shippers S INNER JOIN Total_Condiments TC
ON S.ShipperID = TC.ShipperID

   sqlite:///mydatabase.db
 * sqlite:///northwind.db
Done.

[('United Package', 622)]